# - , +
# =, + , - , * , / , += , -= , *= , /= , ** , % , %= , // , //=



'''a = 5
b = 4

c = (2 + 2) * 2 ** 2
print(a)
print(b)
print(c)'''


# Дана длина L окружности. Найти ее радиус R и площадь S круга, ог-
# раниченного этой окружностью,

'''L = float(input("Введіть довжину кола : "))
P = 3.14
R = L/(2 * P)
S = P * R * R
print("R = ", R)
print("S = ", S)'''


# Даны три точки A, B, C на числовой оси. Найти длины отрезков AC
# и BC и их сумму.

'''A = int(input("A = "))
B = int(input("B = "))
C = int(input("C = "))

CB = abs(C - B)
CA = abs(C - A)
S = CB + CA
print("CB =", CB)
print("CA =", CA)
print("S =", S)'''


# Даны три точки A, B, C на числовой оси. Точка C расположена между
# точками A и B. Найти произведение длин отрезков AC и BC.
'''A = int(input("A = "))
B = int(input("B = "))
C = int(input("C = "))

CB = abs(C - B)
CA = abs(C - A)
S = CB * CA
print("CB =", CB)
print("CA =", CA)
print("S =", S)'''


# Даны координаты двух противоположных вершин прямоугольника:
# (x1, y1), (x2, y2). Стороны прямоугольника параллельны осям координат.
# Найти периметр и площадь данного прямоугольника.
'''x1 = int(input("x1 = "))
y1 = int(input("y1 = "))
x2 = int(input("x2 = "))
y2 = int(input("y2 = "))

a = abs(x2 - x1)
b = abs(y2 - y1)

S = a * b
print("S =", S)'''


# Поменять местами содержимое переменных A и B и вывести новые
# значения A и B.

A = int(input("A = ")) # 5
B = int(input("B = ")) # 4

T = A
A = B
B = T

print(A)
print(B)

